In [1]:
import pandas as pd
import numpy as np

In [18]:
#46
''' Write a Pandas program to check whether a given column is present in a DataFrame or not'''
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
col = input('enter the name of column  : ')
if (col in df.columns) == False:
    print(col,' is not present in DataFrame')
else:
    print(col,' is present in DataFrame')

enter the name of column  : col1
col1  is present in DataFrame

In [19]:
#47
'''Write a Pandas program to get the specified row value of a given DataFrame.'''
row = int(input('enter the numbere of row  : '))
df.iloc[row]

enter the numbere of row  : 0

col1    1
col2    4
col3    7
Name: 0, dtype: int64

In [20]:
#48
'''Write a Pandas program to get the datatypes of columns of a DataFrame'''
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']})
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [21]:
#49
'''Write a Pandas program to sort a given DataFrame by two or more columns'''
df1 = pd.DataFrame()
df2 = pd.DataFrame({"col1": range(3),"col2": range(3)})
df1.append(df2)

   col1  col2
0     0     0
1     1     1
2     2     2

In [24]:
#50
''' Write a Pandas program to sort a given DataFrame by two or more columns'''
df.sort_values(by=['name','score'],ascending=False)

        name  score  attempts qualify
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
2  Katherine   16.5         2     yes
9      Jonas   19.0         1     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes

In [34]:
#51
'''Write a Pandas program to convert the datatype of a given column (floats to ints).'''
df = df.fillna(0)
df['score'] = df['score'].astype('int64')
df

        name  score  attempts qualify
0  Anastasia     12         1     yes
1       Dima      9         3      no
2  Katherine     16         2     yes
3      James      0         3      no
4      Emily      9         2      no
5    Michael     20         3     yes
6    Matthew     14         1     yes
7      Laura      0         1      no
8      Kevin      8         2      no
9      Jonas     19         1     yes

In [35]:
#52
'''Write a Pandas program to remove infinite values from a given DataFrame'''
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df.replace([np.inf,-np.inf],np.nan)

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

In [37]:
#53
'''Write a Pandas program to insert a given column at a specific column index in a DataFrame'''
df = pd.DataFrame({'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
col1 = [1, 2, 3, 4, 7]
df.insert(0,'col1',col1)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [38]:
#54
'''Write a Pandas program to convert a given list of lists into a Dataframe'''
lst = [[2, 4], [1, 3]]
pd.DataFrame(lst)

   0  1
0  2  4
1  1  3

In [46]:
#55
'''Write a Pandas program to group by the first column and get second column as lists in rows'''
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df.groupby(by='col1')['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

In [53]:
#56
'''Write a Pandas program to get column index from column name of a given DataFrame'''
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
df.columns.get_loc('col2')

1

In [57]:
#57
'''Write a Pandas program to count number of columns of a DataFrame'''
len(df.columns)

3

In [60]:
#58
'''Write a Pandas program to select all columns, except one given column in a DataFrame'''
df[df.drop('col3',axis=1).columns]

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [65]:
#59
'''Write a Pandas program to get first n records of a DataFrame'''
n = int(input('enter the first n rows'))
df.head(n)

enter the first n rows3

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

In [66]:
#60
'''Write a Pandas program to get last n records of a DataFrame'''
n = int(input('enter the first n rows'))
df.tail(n)

enter the first n rows3

   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5    11